# Name : Nishank Bhola

# Question 1
What value is displayed when the last expression (a) is evaluated? Explain your
answer by indicating what happens in every executed statement.

In [1]:
a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2

b()
b()
b()

print(a)

6

We get a = 6 as variable a is global.

when b() is executed first time a=0 become (a=2) due to function c <br />
when b() is executed second time a=2 become (a=4) due to function c<br />
when b() is executed third time a=4 become (a=6) due to function c<br />

Hence, when we print a we get 6.

# Question 2
Function fileLength(), given to you, takes the name of a file as input and returns
the length of the file:<br /> 
if the file cannot be found by the interpreter or if it cannot be read
as a text file, an exception will be raised. Modify function fileLength() so that a
friendly message is printed instead:

In [39]:
def fileLength(filename):
    
    try:
        file = open(filename)
        content = file.read()
        print(len(content))
    except FileNotFoundError:
        print("File " + filename+" not found.")

fileLength('idterm.py')

File idterm.py not found.

In [40]:
fileLength('filelength.txt')

123

# Question 3 
Write a class named Marsupial <br /> 
a. extends the Marsupial __init__ constructor to take, as input, the
coordinates x and y of the Kangaroo object,<br />
b. supports method jump that takes number values dx and dy as input and
moves the kangaroo by dx units along the x-axis and by dy units along the yaxis, and<br /> 
c. overloads the __str__ operator so it behaves as shown below.

In [4]:
class Marsupial:
    def __init__(self):
        self.listOfContents = []
    def put_in_pouch(self, stringGiven):
        self.listOfContents.append(stringGiven)
    
    def pouch_contents(self):
        return self.listOfContents
    
m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()

['doll', 'firetruck', 'kitten']

In [5]:
class Kangaroo(Marsupial):
    def __init__(self , x , y):
        super().__init__()
        self.x = x
        self.y = y
    def jump(self,updatedX ,updatedY):
        self.x += updatedX
        self.y += updatedY
    def __repr__(self):
        return "I am a Kangaroo located at coordinates (" +str(self.x)+","+str(self.y)+")";

In [6]:
k = Kangaroo(0,0)
print(k)

I am a Kangaroo located at coordinates (0,0)

In [7]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()

['doll', 'firetruck', 'kitten']

In [8]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (3,0)

# Question 4
Write function collatz()

In [9]:
def collatz(num):
    if (num == 1):
        return int(num)
    elif(num%2==0):
        print(int(num))
        return collatz(num/2)
    else:
        print(int(num))
        return collatz(3*(num) + 1)
    
collatz(10)

10
5
16
8
4
2

1

In [10]:
collatz(1)

1

# Question 5
Write a recursive method binary()

In [11]:

def NumToBinary(num):
    
    if num >= 1:
        NumToBinary(num // 2)
        print(str(num%2), end="")

NumToBinary(3)

11

In [12]:
NumToBinary(10)

1010

# Question 6

Implement a class named HeadingParser

In [43]:
from html.parser import HTMLParser
class HeadingParser(HTMLParser):
    def __init__(self):
        HTMLParser.__init__(self)
        self.headings = ['h1','h2','h3','h4','h5','h6']
        self.lasttag = ''
    def handle_starttag(self, tag, attrs):
        if tag in self.headings:
            self.lasttag = tag


    def handle_data(self, data):
        if self.lasttag in self.headings:
            self.lasttag = list(self.lasttag)
            #print(self.lasttag)
            space = " "*int(self.lasttag[1])
            print (space+data)


infile = open('w3c.html')
content = infile.read()
#print(content)
infile.close()
hp = HeadingParser()
hp.feed(content)

 W3C Mission
  Principles

# Question 7
Implement recursive function webdir()

In [14]:
#http://reed.cs.depaul.edu/lperkovic/test1.html
from urllib.parse import urljoin
from urllib.request import urlopen
class Collector(HTMLParser):
    def __init__(self , url):
        HTMLParser.__init__(self)
        self.url = url
        self.links = []
    def handle_starttag(self , tag , attrs):
        if tag == 'a':
            for attr in attrs:
                if attr[0] == 'href':
                    absolute = urljoin(self.url , attr[1])
                    if absolute[:4] == 'https' or absolute[:4] == 'http':
                        self.links.append(absolute)
    def getLinks(self):
        return self.links

    
url = 'http://reed.cs.depaul.edu/lperkovic/test1.html'
resource = urlopen(url)
content = resource.read().decode()
collectorObj = Collector(url)
collectorObj.feed(content)
collectorObj.getLinks()

['http://reed.cs.depaul.edu/lperkovic/test2.html',
 'http://reed.cs.depaul.edu/lperkovic/test3.html']

In [15]:
def webdir(url , depth , indent):
    resource = urlopen(url)
    content = resource.read().decode()
    collectorObj = Collector(url)
    collectorObj.feed(content)
    for index , link in enumerate(collectorObj.getLinks()):
        
        space = " "*indent
        
        print(space+str(link))
        indent = indent + 1
        webdir(link,depth , indent)
    #return collectorObj.getLinks()

webdir('http://reed.cs.depaul.edu/lperkovic/test1.html', 2, 0)

http://reed.cs.depaul.edu/lperkovic/test2.html
 http://reed.cs.depaul.edu/lperkovic/test4.html
 http://reed.cs.depaul.edu/lperkovic/test3.html
  http://reed.cs.depaul.edu/lperkovic/test4.html

# Question 8
SQL queries

In [16]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [17]:
%%sql

CREATE TABLE MyTable
(
    City text,
    Country text,
    Season text,
    Temperature float,
    Rainfall float
)

 * sqlite://
Done.

[]

In [18]:
%%sql
INSERT INTO MyTable
VALUES ('Mumbai', 'India', 'Winter' , 24.8, 5.9),
       ('Mumbai', 'India', 'Spring', 28.4, 16.2 ),
       ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
       ('Mumbai', 'India', 'Fall', 27.6, 346.0),
       ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
       ('London', 'United Kingdom', 'Spring', 8.3, 169.6 ),
       ('London', 'United Kingdom', 'Summer', 15.7, 157.0 ),
        ('London', 'United Kingdom', 'Fall', 10.4, 218.5 ),
        ('Cairo', 'Egypt', 'Winter', 13.6, 16.5 ),
        ('Cairo', 'Egypt', 'Spring', 20.7, 6.5 ),
        ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
        ('Cairo', 'Egypt', 'Fall', 22.2, 4.5);

 * sqlite://
12 rows affected.

[]

In [21]:
#a) All the temperature data.
%%sql
SELECT * from MyTable;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Winter', 4.2, 207.7),
 ('London', 'United Kingdom', 'Spring', 8.3, 169.6),
 ('London', 'United Kingdom', 'Summer', 15.7, 157.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 ('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 ('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [23]:
#b) All the cities, but without repetition.
%%sql
SELECT DISTINCT City from MyTable;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [24]:
#c) All the records for India.
%%sql
SELECT * from MyTable WHERE Country="India";

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', 24.8, 5.9),
 ('Mumbai', 'India', 'Spring', 28.4, 16.2),
 ('Mumbai', 'India', 'Summer', 27.9, 1549.4),
 ('Mumbai', 'India', 'Fall', 27.6, 346.0)]

In [25]:
#d) All the Fall records.
%%sql
SELECT * from MyTable WHERE Season="Fall";

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', 27.6, 346.0),
 ('London', 'United Kingdom', 'Fall', 10.4, 218.5),
 ('Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

In [29]:
# e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.
%%sql
SELECT City , Country , Season from MyTable WHERE Rainfall BETWEEN 200 AND 400;

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall')]

In [42]:
# f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.
%%sql
SELECT City , Country from MyTable WHERE Temperature > 20 AND Season = "Fall" ORDER BY Temperature ASC;

 * sqlite://
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

In [37]:
# g) The total annual rainfall for Cairo.
%%sql
SELECT SUM(Rainfall) from MyTable WHERE City="Cairo";

 * sqlite://
Done.

[(27.6,)]

In [38]:
# h) The total rainfall for each season.
%%sql
SELECT Season , SUM(Rainfall) from MyTable GROUP BY Season;

 * sqlite://
Done.

[('Fall', 569.0),
 ('Spring', 192.29999999999998),
 ('Summer', 1706.5),
 ('Winter', 230.1)]

# Question 9

In [48]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

# A
myList = [word.upper() for word in words]
print(myList)

# B
myList = [word.lower() for word in words]
print(myList)

# C
myList = [len(word) for word in words]
print(myList)

# D
myList = [[word.upper(),word.lower(),len(word)] for word in words]
print(myList)

# E
myList = [word for word in words if len(word)>=4]
print(myList)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
[3, 5, 5, 3, 5, 4, 3, 4, 3]
[['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]
['quick', 'brown', 'jumps', 'over', 'lazy']